<a href="https://colab.research.google.com/github/sidharth-ds/Data-Cleaning/blob/main/Cleaning_using_PySpark.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
!pip install pyspark

Collecting pyspark
  Downloading pyspark-3.2.1.tar.gz (281.4 MB)
     |████████████████████████████████| 281.4 MB 30 kB/s
Collecting py4j==0.10.9.3
  Downloading py4j-0.10.9.3-py2.py3-none-any.whl (198 kB)
     |████████████████████████████████| 198 kB 56.3 MB/s
Building wheels for collected packages: pyspark
  Building wheel for pyspark (setup.py) ... done
  Created wheel for pyspark: filename=pyspark-3.2.1-py2.py3-none-any.whl size=281853642 sha256=b4060a5754af5931ab335e325f15d5a7e93ab6486fd573990b404c2cacebf395
  Stored in directory: /root/.cache/pip/wheels/9f/f5/07/7cd8017084dce4e93e84e92efd1e1d5334db05f2e83bcef74f
Successfully built pyspark
Installing collected packages: py4j, pyspark
Successfully installed py4j-0.10.9.3 pyspark-3.2.1

In [ ]:
import pyspark

pyspark program:
* Driver:
  - creating session
* Dag: directed acyclic graph
  - purpose: to split the task into pieces
  - scheduling the tasks
* Yarn:
  - run the tasks

In [ ]:
dir(pyspark)

To use pyspark:
* import session package
* create session

In [ ]:
from pyspark.sql import SparkSession

In [ ]:
spark = SparkSession.builder.appName('sample').getOrCreate()

## creating Dataframe using pyspark:

In [ ]:
data1 = [("Arun","kumar","s",56,"m",45000),("Magesh","","sasi",48,"m",12000),("bala","s","",89,"m",5000)]

In [ ]:
from pyspark.sql.types import StructField, StructType, StringType, IntegerType

* StructType = table format
* StructField = columns

* schema = how table stucture should be?

In [ ]:
schema1 = StructType([
                     StructField('firstname',StringType(),True),
                     StructField('middlename',StringType(),True),
                     StructField('lastname',StringType(),True),
                     StructField('id',IntegerType(),True),
                     StructField('gender',StringType(),True),
                     StructField('salary',StringType(),True),
])

* dx is  dataframe

In [ ]:
dx = spark.createDataFrame(data=data1,schema=schema1)

In [ ]:
dx.show()

+---------+----------+--------+---+------+------+
|firstname|middlename|lastname| id|gender|salary|
+---------+----------+--------+---+------+------+
|     Arun|     kumar|       s| 56|     m| 45000|
|   Magesh|          |    sasi| 48|     m| 12000|
|     bala|         s|        | 89|     m|  5000|
+---------+----------+--------+---+------+------+

In [ ]:
dx.printSchema()

root
 |-- firstname: string (nullable = true)
 |-- middlename: string (nullable = true)
 |-- lastname: string (nullable = true)
 |-- id: integer (nullable = true)
 |-- gender: string (nullable = true)
 |-- salary: string (nullable = true)

* to convert spark dataframe into pandas dataframe:

In [ ]:
dx_pd = dx.toPandas()
dx_pd

  firstname middlename lastname  id gender salary
0      Arun      kumar        s  56      m  45000
1    Magesh                sasi  48      m  12000
2      bala          s           89      m   5000

* automatically connects datatype (not preferable)

In [ ]:
col = ["fname","mname","lname","id","gender","salary"]

In [ ]:
dy = spark.createDataFrame(data=data1,schema=col)
dy.printSchema()
dy.show()

root
 |-- fname: string (nullable = true)
 |-- mname: string (nullable = true)
 |-- lname: string (nullable = true)
 |-- id: long (nullable = true)
 |-- gender: string (nullable = true)
 |-- salary: long (nullable = true)

+------+-----+-----+---+------+------+
| fname|mname|lname| id|gender|salary|
+------+-----+-----+---+------+------+
|  Arun|kumar|    s| 56|     m| 45000|
|Magesh|     | sasi| 48|     m| 12000|
|  bala|    s|     | 89|     m|  5000|
+------+-----+-----+---+------+------+

## creating a csv file:

In [ ]:
df=spark.read.format("csv").load("/content/SAMPLE.csv")
df.printSchema()
df.show()

root
 |-- _c0: string (nullable = true)
 |-- _c1: string (nullable = true)
 |-- _c2: string (nullable = true)
 |-- _c3: string (nullable = true)
 |-- _c4: string (nullable = true)
 |-- _c5: string (nullable = true)
 |-- _c6: string (nullable = true)

+-----+----+-------------------+-----+----+-------+-----+
|  _c0| _c1|                _c2|  _c3| _c4|    _c5|  _c6|
+-----+----+-------------------+-----+----+-------+-----+
|sl No|name|            college|  hsc|SSLC|arrears|cmark|
|    1|  A1|               IITM| 89.9|92.6|      0|   95|
|    2|  A2|    ANNA UNIVERSITY| 76.8|77.9|   null|   89|
|    3|  A3|    ANNA UNIVERSITY|88.39|85.6|      6|   99|
|    4|  A4|ANAMALAI UNIVERSITY| 92.5|94.6|      1|   76|
|    5|  A5|               null| 79.3|  65|      2|   89|
|    6|  A6|                SRM| null|88.1|      0| 89.6|
|    7|  A7|           SAVEETHA| 91.8|null|      7| 78.3|
|    8|  A8|               null| 99.8|65.8|      6| 77.5|
| null|null|               null| null|null|   null| null|
|    9|  A9|ANAMALAI UNIVERSITY| 98.7|  91|      2|   76|
|   10|  AD|             fogjof|   56|   9|     78|    2|
|   11| A10|               IITM|   94|77.6|      1|   75|
|   12| A11|               IITK| 88.2|75.9|      2|   72|
|   13| A12|               null| 78.9|84.9|      3|   83|
|   14| A13|                SRM| 86.9|  97|      4|   92|
+-----+----+-------------------+-----+----+-------+-----+

* to pull out Header:

In [ ]:
df1 = spark.read.option("header",True).csv("/content/SAMPLE.csv")
df1.printSchema()
df1.show()

root
 |-- sl No: string (nullable = true)
 |-- name: string (nullable = true)
 |-- college: string (nullable = true)
 |-- hsc: string (nullable = true)
 |-- SSLC: string (nullable = true)
 |-- arrears: string (nullable = true)
 |-- cmark: string (nullable = true)

+-----+----+-------------------+-----+----+-------+-----+
|sl No|name|            college|  hsc|SSLC|arrears|cmark|
+-----+----+-------------------+-----+----+-------+-----+
|    1|  A1|               IITM| 89.9|92.6|      0|   95|
|    2|  A2|    ANNA UNIVERSITY| 76.8|77.9|   null|   89|
|    3|  A3|    ANNA UNIVERSITY|88.39|85.6|      6|   99|
|    4|  A4|ANAMALAI UNIVERSITY| 92.5|94.6|      1|   76|
|    5|  A5|               null| 79.3|  65|      2|   89|
|    6|  A6|                SRM| null|88.1|      0| 89.6|
|    7|  A7|           SAVEETHA| 91.8|null|      7| 78.3|
|    8|  A8|               null| 99.8|65.8|      6| 77.5|
| null|null|               null| null|null|   null| null|
|    9|  A9|ANAMALAI UNIVERSITY| 98.7|  91|      2|   76|
|   10|  AD|             fogjof|   56|   9|     78|    2|
|   11| A10|               IITM|   94|77.6|      1|   75|
|   12| A11|               IITK| 88.2|75.9|      2|   72|
|   13| A12|               null| 78.9|84.9|      3|   83|
|   14| A13|                SRM| 86.9|  97|      4|   92|
+-----+----+-------------------+-----+----+-------+-----+

* writing the file:

In [ ]:
df1.write.option("header",True).csv("/content/sasa")

## Duplicates:

In [ ]:
data2 = [("arun","Mech",45000),("maheshsiwueyyyyyyeeeebfffffffnnn","Aero",12000),("bala","Cse",5000),("mano","Mech",5000),("abishek","Aero",5000),("rohan","ece",5000),("rohan","ece",5000)]
col=["name","dept","salary"]
df2= spark.createDataFrame(data= data2,schema=col)
df2.printSchema()
df2.show()

root
 |-- name: string (nullable = true)
 |-- dept: string (nullable = true)
 |-- salary: long (nullable = true)

+--------------------+----+------+
|                name|dept|salary|
+--------------------+----+------+
|                arun|Mech| 45000|
|maheshsiwueyyyyyy...|Aero| 12000|
|                bala| Cse|  5000|
|                mano|Mech|  5000|
|             abishek|Aero|  5000|
|               rohan| ece|  5000|
|               rohan| ece|  5000|
+--------------------+----+------+

to show the entire name:
* truncate( )

In [ ]:
df2.show(truncate=False)

+--------------------------------+----+------+
|name                            |dept|salary|
+--------------------------------+----+------+
|arun                            |Mech|45000 |
|maheshsiwueyyyyyyeeeebfffffffnnn|Aero|12000 |
|bala                            |Cse |5000  |
|mano                            |Mech|5000  |
|abishek                         |Aero|5000  |
|rohan                           |ece |5000  |
|rohan                           |ece |5000  |
+--------------------------------+----+------+

* to remove duplicate rows: (shows only unique rows)

In [ ]:
df2_px = df2.distinct()
df2_px.show()

+--------------------+----+------+
|                name|dept|salary|
+--------------------+----+------+
|                bala| Cse|  5000|
|maheshsiwueyyyyyy...|Aero| 12000|
|                arun|Mech| 45000|
|                mano|Mech|  5000|
|             abishek|Aero|  5000|
|               rohan| ece|  5000|
+--------------------+----+------+

* another method to remove duplicates:

In [ ]:
df2_x = df2.dropDuplicates()
df2_x.show()

+--------------------+----+------+
|                name|dept|salary|
+--------------------+----+------+
|                bala| Cse|  5000|
|maheshsiwueyyyyyy...|Aero| 12000|
|                arun|Mech| 45000|
|                mano|Mech|  5000|
|             abishek|Aero|  5000|
|               rohan| ece|  5000|
+--------------------+----+------+

In [ ]:
data3 = [("arun","Mech",45000),("mahesh","Aero",12000),("bala","Cse",5000),("mano","Mech",5000),("abishek","Aero",5000),("rohan","ece",5000),("rohan","ece",5000)]
col=["name","dept","salary"]
df3= spark.createDataFrame(data= data3,schema=col)
df3.printSchema()
df3.show()

root
 |-- name: string (nullable = true)
 |-- dept: string (nullable = true)
 |-- salary: long (nullable = true)

+-------+----+------+
|   name|dept|salary|
+-------+----+------+
|   arun|Mech| 45000|
| mahesh|Aero| 12000|
|   bala| Cse|  5000|
|   mano|Mech|  5000|
|abishek|Aero|  5000|
|  rohan| ece|  5000|
|  rohan| ece|  5000|
+-------+----+------+

* unique value for department only:

In [ ]:
df3_a = df3.dropDuplicates(['dept'])
df3_a.show()

+------+----+------+
|  name|dept|salary|
+------+----+------+
|mahesh|Aero| 12000|
|  bala| Cse|  5000|
|  arun|Mech| 45000|
| rohan| ece|  5000|
+------+----+------+

* if duplicate in both the columns, then only dropped.
* similar to 'AND' operation
* also sorted based on 1st column

In [ ]:
df3_b = df3.dropDuplicates(['dept','salary'])
df3_b.show()

+-------+----+------+
|   name|dept|salary|
+-------+----+------+
|abishek|Aero|  5000|
| mahesh|Aero| 12000|
|   bala| Cse|  5000|
|   mano|Mech|  5000|
|   arun|Mech| 45000|
|  rohan| ece|  5000|
+-------+----+------+

In [ ]:
df3_c = df3.dropDuplicates(['salary','dept'])
df3_c.show()

+-------+----+------+
|   name|dept|salary|
+-------+----+------+
|abishek|Aero|  5000|
|   bala| Cse|  5000|
|   mano|Mech|  5000|
|  rohan| ece|  5000|
| mahesh|Aero| 12000|
|   arun|Mech| 45000|
+-------+----+------+

In [ ]:
df3.show()

+-------+----+------+
|   name|dept|salary|
+-------+----+------+
|   arun|Mech| 45000|
| mahesh|Aero| 12000|
|   bala| Cse|  5000|
|   mano|Mech|  5000|
|abishek|Aero|  5000|
|  rohan| ece|  5000|
|  rohan| ece|  5000|
+-------+----+------+

## Filter( )

== , != , > , <  , ...

In [ ]:
df3.filter(df3.dept == 'Mech').show()

+----+----+------+
|name|dept|salary|
+----+----+------+
|arun|Mech| 45000|
|mano|Mech|  5000|
+----+----+------+

In [ ]:
df3.filter(df3.dept != 'Mech').show()

+-------+----+------+
|   name|dept|salary|
+-------+----+------+
| mahesh|Aero| 12000|
|   bala| Cse|  5000|
|abishek|Aero|  5000|
|  rohan| ece|  5000|
|  rohan| ece|  5000|
+-------+----+------+

* 'NOT' operator :(another form)

In [ ]:
df3.filter(~(df3.dept == 'Mech')).show()

+-------+----+------+
|   name|dept|salary|
+-------+----+------+
| mahesh|Aero| 12000|
|   bala| Cse|  5000|
|abishek|Aero|  5000|
|  rohan| ece|  5000|
|  rohan| ece|  5000|
+-------+----+------+

In [ ]:
df3.filter(df3.salary > 5000).show()

+------+----+------+
|  name|dept|salary|
+------+----+------+
|  arun|Mech| 45000|
|mahesh|Aero| 12000|
+------+----+------+

* AND operator:

In [ ]:
df3.filter((df3.salary > 5000) & (df3.dept == 'Aero')).show()

+------+----+------+
|  name|dept|salary|
+------+----+------+
|mahesh|Aero| 12000|
+------+----+------+

* OR operator:

In [ ]:
df3.filter((df3.salary > 5000) | (df3.dept == 'Aero')).show()

+-------+----+------+
|   name|dept|salary|
+-------+----+------+
|   arun|Mech| 45000|
| mahesh|Aero| 12000|
|abishek|Aero|  5000|
+-------+----+------+

* isin( ):

In [ ]:
x_dept = ['Aero','Mech','Cse'] 
df3.filter(df3.dept.isin(x_dept)).show()

+-------+----+------+
|   name|dept|salary|
+-------+----+------+
|   arun|Mech| 45000|
| mahesh|Aero| 12000|
|   bala| Cse|  5000|
|   mano|Mech|  5000|
|abishek|Aero|  5000|
+-------+----+------+

In [ ]:
x_dept = ['Aero','Mech','Cse','IT'] 
y_salary = [5000,12000,45000,60000]

df3.filter(df3.dept.isin(x_dept) & df3.salary.isin(y_salary)).show()

+-------+----+------+
|   name|dept|salary|
+-------+----+------+
|   arun|Mech| 45000|
| mahesh|Aero| 12000|
|   bala| Cse|  5000|
|   mano|Mech|  5000|
|abishek|Aero|  5000|
+-------+----+------+

In [ ]:
df3.filter(df3.name.startswith('a')).show()

+-------+----+------+
|   name|dept|salary|
+-------+----+------+
|   arun|Mech| 45000|
|abishek|Aero|  5000|
+-------+----+------+

In [ ]:
df3.filter(df3.name.endswith('n')).show()

+-----+----+------+
| name|dept|salary|
+-----+----+------+
| arun|Mech| 45000|
|rohan| ece|  5000|
|rohan| ece|  5000|
+-----+----+------+

In [ ]:
df3.filter(df3.name.endswith('la')).show()

+----+----+------+
|name|dept|salary|
+----+----+------+
|bala| Cse|  5000|
+----+----+------+

In [ ]:
df3.show()

+-------+----+------+
|   name|dept|salary|
+-------+----+------+
|   arun|Mech| 45000|
| mahesh|Aero| 12000|
|   bala| Cse|  5000|
|   mano|Mech|  5000|
|abishek|Aero|  5000|
|  rohan| ece|  5000|
|  rohan| ece|  5000|
+-------+----+------+

In [ ]:
data4 = [("arun","Mech",45000),("maheshjgsh","Aero",12000),("basrkjgla","Cse",70000),("majgno","Mech",49000),("abishek","Aero",65000),("deepak","ece",35000),("rohan","ece",5000),("suresh","ece",5000),("prakash","ece",5000)]
col=["name","dept","salary"]
df4= spark.createDataFrame(data= data4,schema=col)
df4.printSchema()
df4.show(truncate=False)

root
 |-- name: string (nullable = true)
 |-- dept: string (nullable = true)
 |-- salary: long (nullable = true)

+----------+----+------+
|name      |dept|salary|
+----------+----+------+
|arun      |Mech|45000 |
|maheshjgsh|Aero|12000 |
|basrkjgla |Cse |70000 |
|majgno    |Mech|49000 |
|abishek   |Aero|65000 |
|deepak    |ece |35000 |
|rohan     |ece |5000  |
|suresh    |ece |5000  |
|prakash   |ece |5000  |
+----------+----+------+

In [ ]:
df4.filter(df4.name.contains('jg')).show()

+----------+----+------+
|      name|dept|salary|
+----------+----+------+
|maheshjgsh|Aero| 12000|
| basrkjgla| Cse| 70000|
|    majgno|Mech| 49000|
+----------+----+------+

In [ ]:
df4.filter(df4.name.contains('sh')).show()

+----------+----+------+
|      name|dept|salary|
+----------+----+------+
|maheshjgsh|Aero| 12000|
|   abishek|Aero| 65000|
|    suresh| ece|  5000|
|   prakash| ece|  5000|
+----------+----+------+

* like() is same as contains()

In [ ]:
df4.filter(df4.name.like("%jg%")).show()

+----------+----+------+
|      name|dept|salary|
+----------+----+------+
|maheshjgsh|Aero| 12000|
| basrkjgla| Cse| 70000|
|    majgno|Mech| 49000|
+----------+----+------+

* %sh -- all characters before (same as endswith)
* sh% -- all characters after  (same as startswith)
* %sh% --- all characters before and after
* _s -- only one character before
* s_ -- only one character after

In [ ]:
df4.filter(df4.name.like("%s_jg%")).show()

+----------+----+------+
|      name|dept|salary|
+----------+----+------+
|maheshjgsh|Aero| 12000|
+----------+----+------+

In [ ]:
df4.filter(df4.name.like("%s__jg%")).show()

+---------+----+------+
|     name|dept|salary|
+---------+----+------+
|basrkjgla| Cse| 70000|
+---------+----+------+

In [ ]:
df4.filter(df4.name.like("%s%jg%")).show()

+----------+----+------+
|      name|dept|salary|
+----------+----+------+
|maheshjgsh|Aero| 12000|
| basrkjgla| Cse| 70000|
+----------+----+------+

# connecting Tables:

Creating 2 tables:
* employee table
* department table

In [ ]:
data5 = [(10,"arun",101,45000),(11,"mahesh",102,12000),(12,"bala",103,70000),(13,"mano",104,49000),(14,"abishek",105,65000),(15,"deepak",106,35000),(16,"rohan",102,5000),(17,"suresh",105,5000),(18,"prakash",103,5000),(19,"surender",106,5000)]
col=["id","name","dept_id","salary"]
df_emp= spark.createDataFrame(data= data5,schema=col)
df_emp.printSchema()
df_emp.show()

data6 = [("hr",101),("rmg",102),("r&d",103),("marketing",104),("accounts",105),("sales",107)]
col3 = ["dept",'deptID']
df_dept = spark.createDataFrame(data= data6,schema=col3)
df_dept.printSchema()
df_dept.show()

root
 |-- id: long (nullable = true)
 |-- name: string (nullable = true)
 |-- dept_id: long (nullable = true)
 |-- salary: long (nullable = true)

+---+--------+-------+------+
| id|    name|dept_id|salary|
+---+--------+-------+------+
| 10|    arun|    101| 45000|
| 11|  mahesh|    102| 12000|
| 12|    bala|    103| 70000|
| 13|    mano|    104| 49000|
| 14| abishek|    105| 65000|
| 15|  deepak|    106| 35000|
| 16|   rohan|    102|  5000|
| 17|  suresh|    105|  5000|
| 18| prakash|    103|  5000|
| 19|surender|    106|  5000|
+---+--------+-------+------+

root
 |-- dept: string (nullable = true)
 |-- deptID: long (nullable = true)

+---------+------+
|     dept|deptID|
+---------+------+
|       hr|   101|
|      rmg|   102|
|      r&d|   103|
|marketing|   104|
| accounts|   105|
|    sales|   107|
+---------+------+

Joining the tables:
* match the required columns

In [ ]:
df_emp.join(df_dept,  df_emp.dept_id == df_dept.deptID, 'inner').show()

+---+-------+-------+------+---------+------+
| id|   name|dept_id|salary|     dept|deptID|
+---+-------+-------+------+---------+------+
| 10|   arun|    101| 45000|       hr|   101|
| 11| mahesh|    102| 12000|      rmg|   102|
| 16|  rohan|    102|  5000|      rmg|   102|
| 12|   bala|    103| 70000|      r&d|   103|
| 18|prakash|    103|  5000|      r&d|   103|
| 13|   mano|    104| 49000|marketing|   104|
| 14|abishek|    105| 65000| accounts|   105|
| 17| suresh|    105|  5000| accounts|   105|
+---+-------+-------+------+---------+------+

* interchanging table position:

In [ ]:
df_dept.join(df_emp,  df_emp.dept_id == df_dept.deptID, 'inner').show()

+---------+------+---+-------+-------+------+
|     dept|deptID| id|   name|dept_id|salary|
+---------+------+---+-------+-------+------+
|       hr|   101| 10|   arun|    101| 45000|
|      rmg|   102| 11| mahesh|    102| 12000|
|      rmg|   102| 16|  rohan|    102|  5000|
|      r&d|   103| 12|   bala|    103| 70000|
|      r&d|   103| 18|prakash|    103|  5000|
|marketing|   104| 13|   mano|    104| 49000|
| accounts|   105| 14|abishek|    105| 65000|
| accounts|   105| 17| suresh|    105|  5000|
+---------+------+---+-------+-------+------+

* inner : similar to AnB
* outer : similar to AuB
  - instead of outer, we can use full/ fullouter

In [ ]:
df_emp.join(df_dept,  df_emp.dept_id == df_dept.deptID, 'outer').show()

+----+--------+-------+------+---------+------+
|  id|    name|dept_id|salary|     dept|deptID|
+----+--------+-------+------+---------+------+
|  10|    arun|    101| 45000|       hr|   101|
|  11|  mahesh|    102| 12000|      rmg|   102|
|  16|   rohan|    102|  5000|      rmg|   102|
|  12|    bala|    103| 70000|      r&d|   103|
|  18| prakash|    103|  5000|      r&d|   103|
|  13|    mano|    104| 49000|marketing|   104|
|  14| abishek|    105| 65000| accounts|   105|
|  17|  suresh|    105|  5000| accounts|   105|
|  15|  deepak|    106| 35000|     null|  null|
|  19|surender|    106|  5000|     null|  null|
|null|    null|   null|  null|    sales|   107|
+----+--------+-------+------+---------+------+

* left : priority to values of left-side table
 - we can use leftouter/left/left_outer
* right :  priority to values of right-side table
  - we can use rightouter/right/right_outer

In [ ]:
df_emp.join(df_dept,  df_emp.dept_id == df_dept.deptID, 'left').show()

+---+--------+-------+------+---------+------+
| id|    name|dept_id|salary|     dept|deptID|
+---+--------+-------+------+---------+------+
| 10|    arun|    101| 45000|       hr|   101|
| 11|  mahesh|    102| 12000|      rmg|   102|
| 16|   rohan|    102|  5000|      rmg|   102|
| 12|    bala|    103| 70000|      r&d|   103|
| 18| prakash|    103|  5000|      r&d|   103|
| 13|    mano|    104| 49000|marketing|   104|
| 14| abishek|    105| 65000| accounts|   105|
| 17|  suresh|    105|  5000| accounts|   105|
| 15|  deepak|    106| 35000|     null|  null|
| 19|surender|    106|  5000|     null|  null|
+---+--------+-------+------+---------+------+

In [ ]:
df_emp.join(df_dept,  df_emp.dept_id == df_dept.deptID, 'right').show()

+----+-------+-------+------+---------+------+
|  id|   name|dept_id|salary|     dept|deptID|
+----+-------+-------+------+---------+------+
|  10|   arun|    101| 45000|       hr|   101|
|  11| mahesh|    102| 12000|      rmg|   102|
|  16|  rohan|    102|  5000|      rmg|   102|
|  12|   bala|    103| 70000|      r&d|   103|
|  18|prakash|    103|  5000|      r&d|   103|
|  13|   mano|    104| 49000|marketing|   104|
|  14|abishek|    105| 65000| accounts|   105|
|  17| suresh|    105|  5000| accounts|   105|
|null|   null|   null|  null|    sales|   107|
+----+-------+-------+------+---------+------+

* leftsemi:
  - left-side table + inner
* leftanti:
  - opposite of leftsemi

In [ ]:
df_emp.join(df_dept,  df_emp.dept_id == df_dept.deptID, 'leftsemi').show()

+---+-------+-------+------+
| id|   name|dept_id|salary|
+---+-------+-------+------+
| 10|   arun|    101| 45000|
| 11| mahesh|    102| 12000|
| 16|  rohan|    102|  5000|
| 12|   bala|    103| 70000|
| 18|prakash|    103|  5000|
| 13|   mano|    104| 49000|
| 14|abishek|    105| 65000|
| 17| suresh|    105|  5000|
+---+-------+-------+------+

In [ ]:
df_emp.join(df_dept,  df_emp.dept_id == df_dept.deptID, 'leftanti').show()

+---+--------+-------+------+
| id|    name|dept_id|salary|
+---+--------+-------+------+
| 15|  deepak|    106| 35000|
| 19|surender|    106|  5000|
+---+--------+-------+------+

In [ ]:
data7 = [(10,"arun",101,45000),(11,"mahesh",102,12000),(12,"bala",103,70000),(13,"mano",104,49000),(14,"abishek",105,65000),(15,"deepak",106,35000)]
data8 = [(16,"rohan",102,5000),(17,"suresh",105,5000),(18,"prakash",103,5000),(19,"surender",106,5000)]
col=["id","name","dept_id","salary"]

df_emp1= spark.createDataFrame(data= data7,schema=col)
df_emp1.printSchema()
df_emp1.show()

df_emp2= spark.createDataFrame(data= data8,schema=col)
df_emp2.printSchema()
df_emp2.show()

root
 |-- id: long (nullable = true)
 |-- name: string (nullable = true)
 |-- dept_id: long (nullable = true)
 |-- salary: long (nullable = true)

+---+-------+-------+------+
| id|   name|dept_id|salary|
+---+-------+-------+------+
| 10|   arun|    101| 45000|
| 11| mahesh|    102| 12000|
| 12|   bala|    103| 70000|
| 13|   mano|    104| 49000|
| 14|abishek|    105| 65000|
| 15| deepak|    106| 35000|
+---+-------+-------+------+

root
 |-- id: long (nullable = true)
 |-- name: string (nullable = true)
 |-- dept_id: long (nullable = true)
 |-- salary: long (nullable = true)

+---+--------+-------+------+
| id|    name|dept_id|salary|
+---+--------+-------+------+
| 16|   rohan|    102|  5000|
| 17|  suresh|    105|  5000|
| 18| prakash|    103|  5000|
| 19|surender|    106|  5000|
+---+--------+-------+------+

* union : to join similar tables (if schema is same)

In [ ]:
df_emp_new = df_emp1.union(df_emp2)
df_emp_new.show()

+---+--------+-------+------+
| id|    name|dept_id|salary|
+---+--------+-------+------+
| 10|    arun|    101| 45000|
| 11|  mahesh|    102| 12000|
| 12|    bala|    103| 70000|
| 13|    mano|    104| 49000|
| 14| abishek|    105| 65000|
| 15|  deepak|    106| 35000|
| 16|   rohan|    102|  5000|
| 17|  suresh|    105|  5000|
| 18| prakash|    103|  5000|
| 19|surender|    106|  5000|
+---+--------+-------+------+

* reverse order:

In [ ]:
df_emp_new = df_emp2.union(df_emp1)
df_emp_new.show()

+---+--------+-------+------+
| id|    name|dept_id|salary|
+---+--------+-------+------+
| 16|   rohan|    102|  5000|
| 17|  suresh|    105|  5000|
| 18| prakash|    103|  5000|
| 19|surender|    106|  5000|
| 10|    arun|    101| 45000|
| 11|  mahesh|    102| 12000|
| 12|    bala|    103| 70000|
| 13|    mano|    104| 49000|
| 14| abishek|    105| 65000|
| 15|  deepak|    106| 35000|
+---+--------+-------+------+

* duplicate data:

In [ ]:
data9 = [(10,"arun",101,45000),(11,"mahesh",102,12000),(12,"bala",103,70000),(13,"mano",104,49000),(14,"abishek",105,65000),(15,"deepak",106,35000)]
data10 = [(16,"rohan",102,5000),(17,"suresh",105,5000),(18,"prakash",103,5000),(19,"surender",106,5000),(14,"abishek",105,65000)]
col=["id","name","dept_id","salary"]

df_emp1= spark.createDataFrame(data= data9,schema=col)
df_emp1.printSchema()
df_emp1.show()

df_emp2= spark.createDataFrame(data= data10,schema=col)
df_emp2.printSchema()
df_emp2.show()

root
 |-- id: long (nullable = true)
 |-- name: string (nullable = true)
 |-- dept_id: long (nullable = true)
 |-- salary: long (nullable = true)

+---+-------+-------+------+
| id|   name|dept_id|salary|
+---+-------+-------+------+
| 10|   arun|    101| 45000|
| 11| mahesh|    102| 12000|
| 12|   bala|    103| 70000|
| 13|   mano|    104| 49000|
| 14|abishek|    105| 65000|
| 15| deepak|    106| 35000|
+---+-------+-------+------+

root
 |-- id: long (nullable = true)
 |-- name: string (nullable = true)
 |-- dept_id: long (nullable = true)
 |-- salary: long (nullable = true)

+---+--------+-------+------+
| id|    name|dept_id|salary|
+---+--------+-------+------+
| 16|   rohan|    102|  5000|
| 17|  suresh|    105|  5000|
| 18| prakash|    103|  5000|
| 19|surender|    106|  5000|
| 14| abishek|    105| 65000|
+---+--------+-------+------+

In [ ]:
df_emp_new1 = df_emp1.union(df_emp2)
df_emp_new1.show()

+---+--------+-------+------+
| id|    name|dept_id|salary|
+---+--------+-------+------+
| 10|    arun|    101| 45000|
| 11|  mahesh|    102| 12000|
| 12|    bala|    103| 70000|
| 13|    mano|    104| 49000|
| 14| abishek|    105| 65000|
| 15|  deepak|    106| 35000|
| 16|   rohan|    102|  5000|
| 17|  suresh|    105|  5000|
| 18| prakash|    103|  5000|
| 19|surender|    106|  5000|
| 14| abishek|    105| 65000|
+---+--------+-------+------+

* to remove duplicates:

In [ ]:
df_emp_new1 = df_emp1.union(df_emp2).distinct()
df_emp_new1.show()

+---+--------+-------+------+
| id|    name|dept_id|salary|
+---+--------+-------+------+
| 10|    arun|    101| 45000|
| 11|  mahesh|    102| 12000|
| 12|    bala|    103| 70000|
| 13|    mano|    104| 49000|
| 14| abishek|    105| 65000|
| 15|  deepak|    106| 35000|
| 17|  suresh|    105|  5000|
| 16|   rohan|    102|  5000|
| 19|surender|    106|  5000|
| 18| prakash|    103|  5000|
+---+--------+-------+------+

In [ ]:
df = spark.read.option("header",True).csv("/content/SAMPLE.csv")
df.show()

+-----+----+-------------------+-----+----+-------+-----+
|sl No|name|            college|  hsc|SSLC|arrears|cmark|
+-----+----+-------------------+-----+----+-------+-----+
|    1|  A1|               IITM| 89.9|92.6|      0|   95|
|    2|  A2|    ANNA UNIVERSITY| 76.8|77.9|   null|   89|
|    3|  A3|    ANNA UNIVERSITY|88.39|85.6|      6|   99|
|    4|  A4|ANAMALAI UNIVERSITY| 92.5|94.6|      1|   76|
|    5|  A5|               null| 79.3|  65|      2|   89|
|    6|  A6|                SRM| null|88.1|      0| 89.6|
|    7|  A7|           SAVEETHA| 91.8|null|      7| 78.3|
|    8|  A8|               null| 99.8|65.8|      6| 77.5|
| null|null|               null| null|null|   null| null|
|    9|  A9|ANAMALAI UNIVERSITY| 98.7|  91|      2|   76|
|   10|  AD|             fogjof|   56|   9|     78|    2|
|   11| A10|               IITM|   94|77.6|      1|   75|
|   12| A11|               IITK| 88.2|75.9|      2|   72|
|   13| A12|               null| 78.9|84.9|      3|   83|
|   14| A13|                SRM| 86.9|  97|      4|   92|
+-----+----+-------------------+-----+----+-------+-----+

In [ ]:
df.fillna(value=23,subset=["arrears"]).show()

+-----+----+-------------------+-----+----+-------+-----+
|sl No|name|            college|  hsc|SSLC|arrears|cmark|
+-----+----+-------------------+-----+----+-------+-----+
|    1|  A1|               IITM| 89.9|92.6|      0|   95|
|    2|  A2|    ANNA UNIVERSITY| 76.8|77.9|   null|   89|
|    3|  A3|    ANNA UNIVERSITY|88.39|85.6|      6|   99|
|    4|  A4|ANAMALAI UNIVERSITY| 92.5|94.6|      1|   76|
|    5|  A5|               null| 79.3|  65|      2|   89|
|    6|  A6|                SRM| null|88.1|      0| 89.6|
|    7|  A7|           SAVEETHA| 91.8|null|      7| 78.3|
|    8|  A8|               null| 99.8|65.8|      6| 77.5|
| null|null|               null| null|null|   null| null|
|    9|  A9|ANAMALAI UNIVERSITY| 98.7|  91|      2|   76|
|   10|  AD|             fogjof|   56|   9|     78|    2|
|   11| A10|               IITM|   94|77.6|      1|   75|
|   12| A11|               IITK| 88.2|75.9|      2|   72|
|   13| A12|               null| 78.9|84.9|      3|   83|
|   14| A13|                SRM| 86.9|  97|      4|   92|
+-----+----+-------------------+-----+----+-------+-----+

In [ ]:
df.na(50).show()

In [ ]:
df['arrears'].fillna(value=23).show()

In [ ]:
df.na.fill(value='30').show()

+-----+----+-------------------+-----+----+-------+-----+
|sl No|name|            college|  hsc|SSLC|arrears|cmark|
+-----+----+-------------------+-----+----+-------+-----+
|    1|  A1|               IITM| 89.9|92.6|      0|   95|
|    2|  A2|    ANNA UNIVERSITY| 76.8|77.9|     30|   89|
|    3|  A3|    ANNA UNIVERSITY|88.39|85.6|      6|   99|
|    4|  A4|ANAMALAI UNIVERSITY| 92.5|94.6|      1|   76|
|    5|  A5|                 30| 79.3|  65|      2|   89|
|    6|  A6|                SRM|   30|88.1|      0| 89.6|
|    7|  A7|           SAVEETHA| 91.8|  30|      7| 78.3|
|    8|  A8|                 30| 99.8|65.8|      6| 77.5|
|   30|  30|                 30|   30|  30|     30|   30|
|    9|  A9|ANAMALAI UNIVERSITY| 98.7|  91|      2|   76|
|   10|  AD|             fogjof|   56|   9|     78|    2|
|   11| A10|               IITM|   94|77.6|      1|   75|
|   12| A11|               IITK| 88.2|75.9|      2|   72|
|   13| A12|                 30| 78.9|84.9|      3|   83|
|   14| A13|                SRM| 86.9|  97|      4|   92|
+-----+----+-------------------+-----+----+-------+-----+

In [ ]:
df.printSchema()

root
 |-- sl No: string (nullable = true)
 |-- name: string (nullable = true)
 |-- college: string (nullable = true)
 |-- hsc: string (nullable = true)
 |-- SSLC: string (nullable = true)
 |-- arrears: string (nullable = true)
 |-- cmark: string (nullable = true)

# Sorting:

In [ ]:
data9 = [(10,"arun",101,45000),(11,"mahesh",102,12000),(12,"bala",103,70000),(13,"",104,49000),(14,"abishek",105,65000),(15,"deepak",106,35000),(16,"rohan",102,5000),(17,"suresh",105,5000),(18,"prakash",103,5000),(19,"surender",106,5000),(14,"abishek",105,65000)]
col=["id","name","dept_id","salary"]

df_emp1= spark.createDataFrame(data= data9,schema=col)
df_emp1.printSchema()
df_emp1.show()

root
 |-- id: long (nullable = true)
 |-- name: string (nullable = true)
 |-- dept_id: long (nullable = true)
 |-- salary: long (nullable = true)

+---+--------+-------+------+
| id|    name|dept_id|salary|
+---+--------+-------+------+
| 10|    arun|    101| 45000|
| 11|  mahesh|    102| 12000|
| 12|    bala|    103| 70000|
| 13|        |    104| 49000|
| 14| abishek|    105| 65000|
| 15|  deepak|    106| 35000|
| 16|   rohan|    102|  5000|
| 17|  suresh|    105|  5000|
| 18| prakash|    103|  5000|
| 19|surender|    106|  5000|
| 14| abishek|    105| 65000|
+---+--------+-------+------+

In [ ]:
df_emp1.sort('name').show()  # sorting 1st way

+---+--------+-------+------+
| id|    name|dept_id|salary|
+---+--------+-------+------+
| 13|        |    104| 49000|
| 14| abishek|    105| 65000|
| 14| abishek|    105| 65000|
| 10|    arun|    101| 45000|
| 12|    bala|    103| 70000|
| 15|  deepak|    106| 35000|
| 11|  mahesh|    102| 12000|
| 18| prakash|    103|  5000|
| 16|   rohan|    102|  5000|
| 19|surender|    106|  5000|
| 17|  suresh|    105|  5000|
+---+--------+-------+------+

In [ ]:
df_emp1.sort(df_emp1.name.asc()).show()   # sorting 2nd way

+---+--------+-------+------+
| id|    name|dept_id|salary|
+---+--------+-------+------+
| 13|        |    104| 49000|
| 14| abishek|    105| 65000|
| 14| abishek|    105| 65000|
| 10|    arun|    101| 45000|
| 12|    bala|    103| 70000|
| 15|  deepak|    106| 35000|
| 11|  mahesh|    102| 12000|
| 18| prakash|    103|  5000|
| 16|   rohan|    102|  5000|
| 19|surender|    106|  5000|
| 17|  suresh|    105|  5000|
+---+--------+-------+------+

In [ ]:
df_emp1.sort(df_emp1.name.desc()).show()

+---+--------+-------+------+
| id|    name|dept_id|salary|
+---+--------+-------+------+
| 17|  suresh|    105|  5000|
| 19|surender|    106|  5000|
| 16|   rohan|    102|  5000|
| 18| prakash|    103|  5000|
| 11|  mahesh|    102| 12000|
| 15|  deepak|    106| 35000|
| 12|    bala|    103| 70000|
| 10|    arun|    101| 45000|
| 14| abishek|    105| 65000|
| 14| abishek|    105| 65000|
| 13|        |    104| 49000|
+---+--------+-------+------+

In [ ]:
from pyspark.sql.functions import col

In [ ]:
df_emp1.sort(col("name").asc()).show()    # sorting 3rd way

+---+--------+-------+------+
| id|    name|dept_id|salary|
+---+--------+-------+------+
| 13|        |    104| 49000|
| 14| abishek|    105| 65000|
| 14| abishek|    105| 65000|
| 10|    arun|    101| 45000|
| 12|    bala|    103| 70000|
| 15|  deepak|    106| 35000|
| 11|  mahesh|    102| 12000|
| 18| prakash|    103|  5000|
| 16|   rohan|    102|  5000|
| 19|surender|    106|  5000|
| 17|  suresh|    105|  5000|
+---+--------+-------+------+

In [ ]:
df_emp1.sort(col("salary").asc() , col("dept_id").desc()).show()  # 1st column 1st priority

+---+--------+-------+------+
| id|    name|dept_id|salary|
+---+--------+-------+------+
| 19|surender|    106|  5000|
| 17|  suresh|    105|  5000|
| 18| prakash|    103|  5000|
| 16|   rohan|    102|  5000|
| 11|  mahesh|    102| 12000|
| 15|  deepak|    106| 35000|
| 10|    arun|    101| 45000|
| 13|        |    104| 49000|
| 14| abishek|    105| 65000|
| 14| abishek|    105| 65000|
| 12|    bala|    103| 70000|
+---+--------+-------+------+

In [ ]:
df_emp1.orderBy(col("salary").asc()).show()  # sorting 4th way

+---+--------+-------+------+
| id|    name|dept_id|salary|
+---+--------+-------+------+
| 16|   rohan|    102|  5000|
| 19|surender|    106|  5000|
| 17|  suresh|    105|  5000|
| 18| prakash|    103|  5000|
| 11|  mahesh|    102| 12000|
| 15|  deepak|    106| 35000|
| 10|    arun|    101| 45000|
| 13|        |    104| 49000|
| 14| abishek|    105| 65000|
| 14| abishek|    105| 65000|
| 12|    bala|    103| 70000|
+---+--------+-------+------+

In [ ]:
df_emp1.groupBy("dept_id").sum(("salary")).show()     # avg / mean

+-------+-----------+
|dept_id|sum(salary)|
+-------+-----------+
|    103|      75000|
|    104|      49000|
|    105|     135000|
|    101|      45000|
|    102|      17000|
|    106|      40000|
+-------+-----------+

In [ ]:
df_emp1.show()

+---+--------+-------+------+
| id|    name|dept_id|salary|
+---+--------+-------+------+
| 10|    arun|    101| 45000|
| 11|  mahesh|    102| 12000|
| 12|    bala|    103| 70000|
| 13|        |    104| 49000|
| 14| abishek|    105| 65000|
| 15|  deepak|    106| 35000|
| 16|   rohan|    102|  5000|
| 17|  suresh|    105|  5000|
| 18| prakash|    103|  5000|
| 19|surender|    106|  5000|
| 14| abishek|    105| 65000|
+---+--------+-------+------+

In [ ]:
df_emp1.groupBy("dept_id").min(("salary")).show()

+-------+-----------+
|dept_id|min(salary)|
+-------+-----------+
|    103|       5000|
|    104|      49000|
|    105|       5000|
|    101|      45000|
|    102|       5000|
|    106|       5000|
+-------+-----------+

In [ ]:
df_emp1.groupBy("dept_id").max(("salary")).show()

+-------+-----------+
|dept_id|max(salary)|
+-------+-----------+
|    103|      70000|
|    104|      49000|
|    105|      65000|
|    101|      45000|
|    102|      12000|
|    106|      35000|
+-------+-----------+

In [ ]:
df_emp1.groupBy("dept_id").count().show()   # count

+-------+-----+
|dept_id|count|
+-------+-----+
|    103|    2|
|    104|    1|
|    105|    3|
|    101|    1|
|    102|    2|
|    106|    2|
+-------+-----+

In [ ]:
df_emp1.groupBy("dept_id").sum(("salary")).count().show()

In [ ]:
df_emp1.groupBy("dept_id").pivot("dept_id").sum(("salary")).show()

+-------+-----+-----+-----+-----+------+-----+
|dept_id|  101|  102|  103|  104|   105|  106|
+-------+-----+-----+-----+-----+------+-----+
|    103| null| null|75000| null|  null| null|
|    104| null| null| null|49000|  null| null|
|    105| null| null| null| null|135000| null|
|    101|45000| null| null| null|  null| null|
|    102| null|17000| null| null|  null| null|
|    106| null| null| null| null|  null|40000|
+-------+-----+-----+-----+-----+------+-----+

# SQL operations in pyspark:

* we are running sql operation inside the dataframe:

In [ ]:
df_emp1.createOrReplaceTempView("emp")  # converting dataframe into sql_view table  # 'emp' is table name
spark.sql("select * from emp").show()     # select * : to select all columns

+---+--------+-------+------+
| id|    name|dept_id|salary|
+---+--------+-------+------+
| 10|    arun|    101| 45000|
| 11|  mahesh|    102| 12000|
| 12|    bala|    103| 70000|
| 13|        |    104| 49000|
| 14| abishek|    105| 65000|
| 15|  deepak|    106| 35000|
| 16|   rohan|    102|  5000|
| 17|  suresh|    105|  5000|
| 18| prakash|    103|  5000|
| 19|surender|    106|  5000|
| 14| abishek|    105| 65000|
+---+--------+-------+------+

In [ ]:
df_emp1.createOrReplaceTempView("emp")  
spark.sql("select * from emp order by name asc").show()   # sorting

+---+--------+-------+------+
| id|    name|dept_id|salary|
+---+--------+-------+------+
| 13|        |    104| 49000|
| 14| abishek|    105| 65000|
| 14| abishek|    105| 65000|
| 10|    arun|    101| 45000|
| 12|    bala|    103| 70000|
| 15|  deepak|    106| 35000|
| 11|  mahesh|    102| 12000|
| 18| prakash|    103|  5000|
| 16|   rohan|    102|  5000|
| 19|surender|    106|  5000|
| 17|  suresh|    105|  5000|
+---+--------+-------+------+

In [ ]:
df_emp1.createOrReplaceTempView("emp")  
spark.sql("select id,name from emp order by name asc").show()   # selecting only particular column + sorting

+---+--------+
| id|    name|
+---+--------+
| 13|        |
| 14| abishek|
| 14| abishek|
| 10|    arun|
| 12|    bala|
| 15|  deepak|
| 11|  mahesh|
| 18| prakash|
| 16|   rohan|
| 19|surender|
| 17|  suresh|
+---+--------+

* row-wise filteration: where clause
* column-wise filteration: select *

In [ ]:
spark.sql("select * from emp where salary > 12000").show()

+---+-------+-------+------+
| id|   name|dept_id|salary|
+---+-------+-------+------+
| 10|   arun|    101| 45000|
| 12|   bala|    103| 70000|
| 13|       |    104| 49000|
| 14|abishek|    105| 65000|
| 15| deepak|    106| 35000|
| 14|abishek|    105| 65000|
+---+-------+-------+------+

In [ ]:
# df_emp1.join(df_dept,  df_emp1.dept_id == df_dept.dept_id, "outer").show()

* mapping from pyspark perspective
* mapping is same as dictionary

In [ ]:
from pyspark.sql.types import *

data_dict = [("arun",{"age":20,"gender":"male"}),("bala",{"age":30,"gender":"male"})]
schema_dict = StructType(
                        [StructField("name",StringType(),True),
                         StructField("personal",MapType(StringType(),StringType()),True )]
                         )
df = spark.createDataFrame(data=data_dict,schema=schema_dict)
df.printSchema()
df.show(truncate=False)

root
 |-- name: string (nullable = true)
 |-- personal: map (nullable = true)
 |    |-- key: string
 |    |-- value: string (valueContainsNull = true)

+----+---------------------------+
|name|personal                   |
+----+---------------------------+
|arun|{gender -> male, age -> 20}|
|bala|{gender -> male, age -> 30}|
+----+---------------------------+

* without StuctType, StructField:

In [ ]:
data_dict = [("arun",{"age":20,"gender":"male"}),("bala",{"age":30,"gender":"male"})]
col = ['name','personal']
df = spark.createDataFrame(data=data_dict,schema=col)
df.printSchema()
df.show(truncate=False)

root
 |-- name: string (nullable = true)
 |-- personal: map (nullable = true)
 |    |-- key: string
 |    |-- value: long (valueContainsNull = true)

+----+---------------------------+
|name|personal                   |
+----+---------------------------+
|arun|{gender -> null, age -> 20}|
|bala|{gender -> null, age -> 30}|
+----+---------------------------+

In [ ]:
data_dict = [("arun",{"gender":"male","age":20}),("bala",{"gender":"male","age":30})]
col = ['name','personal']
df = spark.createDataFrame(data=data_dict,schema=col)
df.printSchema()
df.show(truncate=False)

root
 |-- name: string (nullable = true)
 |-- personal: map (nullable = true)
 |    |-- key: string
 |    |-- value: string (valueContainsNull = true)

+----+---------------------------+
|name|personal                   |
+----+---------------------------+
|arun|{gender -> male, age -> 20}|
|bala|{gender -> male, age -> 30}|
+----+---------------------------+

* 3 features:

In [ ]:
data_dict = [("arun",{"age":20},{"gender":"male"}),("bala",{"age":30},{"gender":"male"})]
col = ['name','age_1','gender_1']
df = spark.createDataFrame(data=data_dict,schema=col)
df.printSchema()
df.show(truncate=False)

root
 |-- name: string (nullable = true)
 |-- age_1: map (nullable = true)
 |    |-- key: string
 |    |-- value: long (valueContainsNull = true)
 |-- gender_1: map (nullable = true)
 |    |-- key: string
 |    |-- value: string (valueContainsNull = true)

+----+-----------+----------------+
|name|age_1      |gender_1        |
+----+-----------+----------------+
|arun|{age -> 20}|{gender -> male}|
|bala|{age -> 30}|{gender -> male}|
+----+-----------+----------------+

In [ ]:
from pyspark.sql.functions import map_keys, map_values

In [ ]:
df.select(df.name,map_keys(df.age_1),map_values(df.gender_1)).show()  # map_keys fetches only keys  # map_values fetches only values

+----+---------------+--------------------+
|name|map_keys(age_1)|map_values(gender_1)|
+----+---------------+--------------------+
|arun|          [age]|              [male]|
|bala|          [age]|              [male]|
+----+---------------+--------------------+

# Json

In [ ]:
dj = spark.read.format('json').load('/content/sample_data/anscombe.json')  
dj.show()

+------+----+-----+---------------+
|Series|   X|    Y|_corrupt_record|
+------+----+-----+---------------+
|  null|null| null|              [|
|     I|10.0| 8.04|           null|
|     I| 8.0| 6.95|           null|
|     I|13.0| 7.58|           null|
|     I| 9.0| 8.81|           null|
|     I|11.0| 8.33|           null|
|     I|14.0| 9.96|           null|
|     I| 6.0| 7.24|           null|
|     I| 4.0| 4.26|           null|
|     I|12.0|10.84|           null|
|     I| 7.0| 4.81|           null|
|     I| 5.0| 5.68|           null|
|    II|10.0| 9.14|           null|
|    II| 8.0| 8.14|           null|
|    II|13.0| 8.74|           null|
|    II| 9.0| 8.77|           null|
|    II|11.0| 9.26|           null|
|    II|14.0|  8.1|           null|
|    II| 6.0| 6.13|           null|
|    II| 4.0|  3.1|           null|
+------+----+-----+---------------+
only showing top 20 rows

In [ ]:
dj1 = spark.read.option('multiline',True).json('/content/sample_data/anscombe.json')
dj1.show()

+------+----+-----+
|Series|   X|    Y|
+------+----+-----+
|     I|10.0| 8.04|
|     I| 8.0| 6.95|
|     I|13.0| 7.58|
|     I| 9.0| 8.81|
|     I|11.0| 8.33|
|     I|14.0| 9.96|
|     I| 6.0| 7.24|
|     I| 4.0| 4.26|
|     I|12.0|10.84|
|     I| 7.0| 4.81|
|     I| 5.0| 5.68|
|    II|10.0| 9.14|
|    II| 8.0| 8.14|
|    II|13.0| 8.74|
|    II| 9.0| 8.77|
|    II|11.0| 9.26|
|    II|14.0|  8.1|
|    II| 6.0| 6.13|
|    II| 4.0|  3.1|
|    II|12.0| 9.13|
+------+----+-----+
only showing top 20 rows

In [ ]:
dj1.write.json("/content/sample.json")    # writing a json file